Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: This function is not supported in that and later versions. It is renamed to [[love.graphics.setShader]]
pt_br: Esta função não é suportada nessa versão e posteriores. Foi renomeada para [[love.graphics.setShader (Português)|love.graphics.setShader]]

source: Enables or disables specific color components when rendering and clearing the screen.
pt_br: Ativa ou desativa componentes de cor específicos ao renderizar e limpar a tela.

source: Draw two lines of text, one scaled and one normal.
pt_br: Desenhar duas linhas de texto, uma redimensionada e uma normal.

source: Some Canvas texture modes have higher system requirements than normal Canvases.
pt_br: Alguns modos de textura de Pinturas exigem mais do sistema que Pinturas normais.

source: Drawing to a framebuffer
pt_br: Desenhar no framebuffer

source: So if a file with a certain filename (and path) exist in both the .love archive and the save folder, the one in the save directory takes precedence.
pt_br: Se um arquivo com certo nome (e caminho) existir tanto no arquivo .love quanto na pasta de escrita, aquele no diretório de escrita terá precedência.

source: * [[ Shader]]
pt_br: * [[ Shader (Português)|Shader]]

source: format ("normal")
pt_br: formato ("normal")

source: Render a starfield.
pt_br: Renderizar um céu estrelado.

source: contents, size = love.filesystem.read( name, size )
pt_br: conteudo, tamanho = love.filesystem.read( nome, tamanho )

source: * [[love.graphics.getLineStyle]]
pt_br: * [[love.graphics.getLineStyle (Português)|love.graphics.getLineStyle]]

source: Creates a new [[SpriteBatch]].
pt_br: Cria um novo [[SpriteBatch (Português)|LoteDeSprites]].

source: function
pt_br: função

source: repeat
pt_br: repeticao

source: Gets the current line width.
pt_br: Obtém a espessura atual da linha.

source: local dir = "" --assuming that our path is full of lovely files (it should at least contain main.lua in this case) local files = love.filesystem.getDirectoryItems(dir) for k, file in ipairs(files) do print(k .. ". " .. file) --outputs something like "1. main.lua" end
pt_br: local dir = "" --supondo que nosso caminho esteja cheio de arquivos do LÖVE (neste caso, deve conter pelo menos o main.lua) local arquivos = love.filesystem.getDirectoryItems(dir) for k, arquivo in ipairs(arquivos) do print(k .. ". " .. arquivo) --imprime algo como "1. main.lua" end

source: output_pos
pt_br: pos_de_saida

source: * [[ love.graphics]]
pt_br: * [[ love.graphics (Português)|love.graphics]]

source: Sources created from SoundData are always static.
pt_br: Fontes criadas a partir de DadosDeSom são sempre estáticas.

source: How the vertices are used when drawing. The default mode "fan" is sufficient for simple convex polygons.
pt_br: Como os vértices serão usados ao desenhar. O modo padrão "fan" (leque) é suficiente para polígonos convexos simples.

source: Creates a new [[File]] object.
pt_br: Cria um novo objeto [[File (Português)|Arquivo]].

source: The angle at which the arc terminates.
pt_br: O ângulo no qual o arco termina.

source: See [[LineJoin]] for the possible options.
pt_br: Veja em [[LineJoin (Português)|JunçãoDeLinha]] as opções possíveis.

source: Image
pt_br: Imagem

source: For example, the following file:
pt_br: Por exemplo, o seguinte arquivo:

source: Sets the default scaling filters.
pt_br: Configura os filtros de redimensionamento padrão.

source: Toggle between [[love.graphics.setPoint|point styles]] with the help of [[love.graphics.getPointStyle]].
pt_br: Alternar entre [[love.graphics.setPoint (Português)|estilos de ponto]] com a ajuda de [[love.graphics.getPointStyle (Português)|love.graphics.getPointStyle]].

source: The desired number of antialiasing samples used when drawing to the Canvas.
pt_br: O número de amostras antisserrilhamento a ser usado para desenhar na Pintura.

source: Whether the red color component is active when rendering.
pt_br: Se o componente de cor vermelha é ativo ou não ao renderizar.

source: Shaders are not programmed in Lua, but by using a special shader language instead.
pt_br: Shaders não são programados em Lua, e sim em uma linguagem de shaders especial.

source: How to draw the quad.
pt_br: Como desenhar o quad.

source: As of LOVE 0.7.1, when using translation and scaling functions while drawing text, this function assumes the scale occurs first.
pt_br: Desde o LOVE 0.7.1, quando se usam funções de translação e redimensionamento ao desenhar texto, esta função supõe que o redimensionamento ocorra primeiro.

source: image = love.graphics.newImage( compressedData )
pt_br: imagem = love.graphics.newImage( dadoComprimido )

source: The new path the archive will be mounted to.
pt_br: O novo caminho no qual o arquivo será montado.

source: If the operation was successful.
pt_br: Se a operação foi um sucesso.

source: canvas = love.graphics.newCanvas( width, height, format )
pt_br: pintura = love.graphics.newCanvas( largura, altura, formato )

source: Draws lines between points.
pt_br: Desenha linhas entre pontos.

source: function love.load() effect = love.graphics.newPixelEffect [[ extern number time; vec4 effect(vec4 color, Image texture, vec2 texture_coords, vec2 pixel_coords) { return vec4((1.0+sin(time))/2.0, abs(cos(time)), abs(sin(time)), 1.0); } ]] end function love.draw() -- boring white love.graphics.setPixelEffect() love.graphics.rectangle('fill', 10,10,790,285) -- LOOK AT THE PRETTY COLORS! love.graphics.setPixelEffect(effect) love.graphics.rectangle('fill', 10,305,790,285) end local t = 0 function love.update(dt) t = t + dt effect:send("time", t) end
pt_br: function love.load() efeito = love.graphics.newPixelEffect [[ extern number time; vec4 effect(vec4 color, Image texture, vec2 texture_coords, vec2 pixel_coords) { return vec4((1.0+sin(time))/2.0, abs(cos(time)), abs(sin(time)), 1.0); } ]] end function love.draw() -- branco chato love.graphics.setPixelEffect() love.graphics.rectangle('fill', 10,10,790,285) -- OLHA QUE CORES BONITAS! love.graphics.setPixelEffect(efeito) love.graphics.rectangle('fill', 10,305,790,285) end local t = 0 function love.update(dt) t = t + dt efeito:send("time", t) end

source: The LineJoin style.
pt_br: O estilo de JunçãoDeLinha.

source: Returns all the files and subdirectories in the directory.
pt_br: Retorna todos arquivos e subdiretórios no diretório.

source: The translation relative to the x-axis.
pt_br: A translação em relação ao eixo x.

source: Returns nil if none is set.
pt_br: Retorna nil se nenhum tiver sido definido.

source: love.graphics.setPixelEffect( pixeleffect )
pt_br: love.graphics.setPixelEffect( efeitodepixel )

source: love.graphics.printf( text, x, y, limit, align )
pt_br: love.graphics.printf( texto, x, y, limite, alinhamento )

source: love.graphics.quad( mode, x1, y1, x2, y2, x3, y3, x4, y4 )
pt_br: love.graphics.quad( modo, x1, y1, x2, y2, x3, y3, x4, y4 )

source: The new distance model.
pt_br: O novo modelo de distância.

source: Gets the current background color.
pt_br: Obtém a cor atual do fundo de tela.

source: The color mask determines whether individual components of the colors of drawn objects will affect the color of the screen.
pt_br: A máscara de cor determina se os componentes individuais das cores de objetos desenhados afetarão a cor da tela ou não.

source: system
pt_br: sistema

source: Load a lua file (but not run it)
pt_br: Carrega um arquivo lua (mas não executa).

source: Vertex Shader Function
pt_br: Função do Shader de Vértice

source: Write data to a file in the save directory.
pt_br: Escreve dados em um arquivo no diretório de escrita.

source: Returns the master volume.
pt_br: Retorna o volume mestre.

source: Calling the function without arguments releases the active stencil.
pt_br: Chamar a função sem argumentos retira o estêncil ativo.

source: Checks for the support of graphics related functions.
pt_br: Verifica o suporte de funções gráficas.

source: function love.load() effect = love.graphics.newShader [[ extern number time; vec4 effect(vec4 color, Image texture, vec2 texture_coords, vec2 pixel_coords) { return vec4((1.0+sin(time))/2.0, abs(cos(time)), abs(sin(time)), 1.0); } ]] end function love.draw() -- boring white love.graphics.setShader() love.graphics.rectangle('fill', 10,10,780,285) -- LOOK AT THE PRETTY COLORS! love.graphics.setShader(effect) love.graphics.rectangle('fill', 10,305,780,285) end local t = 0 function love.update(dt) t = t + dt effect:send("time", t) end
pt_br: function love.load() efeito = love.graphics.newShader [[ extern number time; vec4 effect(vec4 color, Image texture, vec2 texture_coords, vec2 pixel_coords) { return vec4((1.0+sin(time))/2.0, abs(cos(time)), abs(sin(time)), 1.0); } ]] end function love.draw() -- branco chato love.graphics.setShader() love.graphics.rectangle('fill', 10,10,780,285) -- OLHA QUE CORES BONITAS! love.graphics.setShader(efeito) love.graphics.rectangle('fill', 10,305,780,285) end local t = 0 function love.update(dt) t = t + dt efeito:send("time", t) end

source: Use the following snippet to circumvent this in 0.8.0;
pt_br: Use o snippet seguinte para contornar isso no 0.8.0;

source: If the number of FSAA samples specified is greater than the maximum supported by the system, the Canvas will still be created but only using the maximum supported amount (this includes 0.)
pt_br: Se o número máximo de amostras de FSAA especificado for maior que o máximo suportado pelo sistema, a Pintura ainda assim será criada, mas usando apenas a quantidade suportada (isso inclui 0).

source: The name (and path) of the file
pt_br: O nome (e caminho) do arquivo

source: This function does not apply retroactively to loaded images.
pt_br: Esta função não se aplica retroativamente a imagens carregadas.

source: blue
pt_br: azul

source: love.filesystem.setIdentity( name )
pt_br: love.filesystem.setIdentity( nome )

source: red
pt_br: vermelho

source: love.filesystem.setIdentity( name, appendToPath )
pt_br: love.filesystem.setIdentity( nome, acrescentarACaminho )

source: The position of top-left corner along x-axis.
pt_br: A posição do canto superior esquerdo ao longo do eixo x.

source: The Canvas set by [[love.graphics.setCanvas|setCanvas]]. Returns nil if drawing to the real screen.
pt_br: A Pintura definida por [[love.graphics.setCanvas (Português)|setCanvas]]. Retorna nil se estiver desenhando na tela real.

source: Wireframe mode should only be used for debugging. The lines drawn with it enabled do not behave like regular love.graphics lines: their widths don't scale with the coordinate transformations or with [[love.graphics.setLineWidth]], and they don't use the smooth LineStyle.
pt_br: O modo de estrutura de arame só deve ser usado para depuração. As linhas desenhadas com ele ativado não se comportam como linhas normais do love.graphics: suas larguras não são redimensionadas por transformações de coordenada ou por [[love.graphics.setLineWidth (Português)|love.graphics.setLineWidth]], e elas não usam o EstiloDeLinha smooth (suave).

source: The position of the top right corner along x-axis.
pt_br: A posição do canto superior direito no eixo x.

source: love.graphics.setStencil( stencilFunction )
pt_br: love.graphics.setStencil( funcaoEstencil )

source: Use [[love.graphics.setPointSize]] and [[love.graphics.setPointStyle]]
pt_br: Use [[love.graphics.setPointSize (Português)|love.graphics.setPointSize]] e [[love.graphics.setPointStyle (Português)|love.graphics.setPointStyle]]

source: height
pt_br: altura

source: ok = love.filesystem.remove( name )
pt_br: ok = love.filesystem.remove( nome )

source: iterator
pt_br: iterador

source: The Y position of the listener.
pt_br: A posição em Y do ouvinte.

source: All drawing operations until the next love.graphics.setCanvas call will be redirected to the specified canvases and not shown on the screen.
pt_br: Todas operações de desenho até a próxima chamada de love.graphics.setCanvas serão redirecionadas às [[Canvas (Português)|Pinturas]] e não serão mostradas na tela.

source: size (all)
pt_br: tamanho (tudo)

source: The desired texture format of the Canvas.
pt_br: O formato de textura desejado para a Pintura.

source: * [[love.filesystem.mount]]
pt_br: * [[love.filesystem.mount (Português)|love.filesystem.mount]]

source: The method to use when decoding the contents.
pt_br: O método que dever ser usado para decodificar o conteúdo.

source: spriteBatch = love.graphics.newSpriteBatch( image, size, usagehint )
pt_br: loteDeSprites = love.graphics.newSpriteBatch( imagem, tamanho, dicadeuso )

source: The vertices of the polygon as a table.
pt_br: Os vértices do polígono em uma tabela.

source: errorstr
pt_br: stringDeErro

source: Coordinate System
pt_br: Sistema de Coordenadas

source: function love.draw() love.graphics.push() love.graphics.scale(0.5, 0.5) -- reduce everything by 50% in both X and Y coordinates love.graphics.print("Scaled text", 50, 50) love.graphics.pop() love.graphics.print("Normal text", 50, 50) end
pt_br: function love.draw() love.graphics.push() love.graphics.scale(0.5, 0.5) -- reduz tudo em 50% tanto em X como em Y love.graphics.print("Texto redimensionado", 50, 50) love.graphics.pop() love.graphics.print("Texto normal", 50, 50) end

source: Sets or resets a [[Framebuffer]] as render target.
pt_br: Configura ou desconfigura um [[Framebuffer (Português)|Framebuffer]] como o alvo de renderização.

source: Wrap the line after this many horizontal pixels.
pt_br: Quebrar a linha depois deste tanto de pixels.

source: The segments parameter determines how many segments are used to draw the arc.
pt_br: O parâmetro segmentos determina quantos segmentos são usados para desenhar o arco.

source: None
pt_br: Nenhum

source: It has been renamed from [[love.audio.getNumSources]]
pt_br: Foi renomeado, antes era [[love.audio.getNumSources (Português)|love.audio.getNumSources]]

source: If you don't script with this in mind, the text won't be in the right position, or possibly even on screen.
pt_br: Se você não programar com isso em mente, o texto não ficará na posição certa, ou talvez nem apareça na tela.

source: The new pixel effect.
pt_br: O novo efeito de pixel.

source: Adds an event to the event queue.
pt_br: Adiciona um evento à fila de eventos.

source: files = love.filesystem.enumerate( dir )
pt_br: arquivos = love.filesystem.enumerate( dir )

source: The type of event.
pt_br: Tipo de evento.

source: Routes drawing operations through a pixel shader.
pt_br: Passa operações de desenho por um shader de pixel.

source: The texture of the image or canvas being drawn.
pt_br: A textura da imagem ou pintura sendo desenhada.

source: rasterizer
pt_br: rasterizador

source: Stops all playing audio.
pt_br: Para todo o áudio que estiver tocando.

source: love.graphics.setWireframe( enable )
pt_br: love.graphics.setWireframe( ativar )

source: numSources = love.audio.getSourceCount( )
pt_br: numFontes = love.audio.getSourceCount( )

source: image = love.graphics.newImage("hamster.png") quad = love.graphics.newQuad(0, 0, 128, 64, image:getWidth(), image:getHeight()) function love.draw() love.graphics.drawq(image, quad, 100, 100) end
pt_br: imagem = love.graphics.newImage("hamster.png") quad = love.graphics.newQuad(0, 0, 128, 64, imagem:getWidth(), imagem:getHeight()) function love.draw() love.graphics.drawq(imagem, quad, 100, 100) end

source: Also, it is worth noting that loaded files can return values.
pt_br: Além disso, é importante notar que os arquivos carregados podem retornar valores.

source: segments
pt_br: segmentos

source: love.graphics.setBlendMode( mode )
pt_br: love.graphics.setBlendMode( modo )

source: Shader Language
pt_br: Linguagem do Shader

source: * [[love.graphics.setLineWidth]]
pt_br: * [[love.graphics.setLineWidth (Português)|love.graphics.setLineWidth]]

source: w = love.graphics.getWidth() / 2 -- half the window width h = love.graphics.getHeight() / 2 -- half the window height function love.draw() local mx, my = love.mouse.getPosition() -- current position of the mouse love.graphics.line(w, h, mx, my) end
pt_br: l = love.graphics.getWidth() / 2 -- metade da largura da tela a = love.graphics.getHeight() / 2 -- metade da altura da tela function love.draw() local mx, my = love.mouse.getPosition() -- posição atual do mouse love.graphics.line(l, a, mx, my) end

source: void effects( vec4 color, Image texture, vec2 texture_coords, vec2 screen_coords ) { // love_Canvases is a writable array of vec4 colors. Each index corresponds to a Canvas. If you don't assign a value to all active canvases, bad things might happen. love_Canvases[0] = color; }
pt_br: void effects( vec4 color, Image texture, vec2 texture_coords, vec2 screen_coords ) { // love_Canvases é um array de cores vec4 com permissão de escrita. Cada índice corresponde a uma Pintura. Se você não atribuir um valor para todas pinturas ativas, coisas ruins podem acontecer. love_Canvases[0] = color; }

source: It has been renamed from [[love.graphics.newFramebuffer]]
pt_br: Foi renomeado, antes era [[love.graphics.newFramebuffer (Português)|love.graphics.newFramebuffer]]

source: Returns an iterator for messages in the event queue.
pt_br: Retorna um iterador para mensagens na fila de eventos.

source: err
pt_br: erro

source: love.graphics.rotate( angle )
pt_br: love.graphics.rotate( angulo )

source: love.graphics.circle( mode, x, y, radius, segments )
pt_br: love.graphics.circle( modo, x, y, raio, segmentos )

source: Render blue component.
pt_br: Renderizar componente azul.

source: Translate down and to the right by 10 pixels.
pt_br: Transladar para baixo e para a direita em 10 pixels.

source: love.graphics.setFont( size )
pt_br: love.graphics.setFont( tamanho )

source: Open a file and read everything
pt_br: Abrir um arquivo e ler tudo

source: A new framebuffer with width/height equal to the window width/height.
pt_br: Um novo framebuffer com altura/largura iguais às altura/largura da janela.

source: Draws a point.
pt_br: Desenha um ponto.

source: Sets the velocity of the listener.
pt_br: Define a velocidade do ouvinte.

source: isSupported
pt_br: ehSuportado

source: Sets the write directory for your game.
pt_br: Configura o diretório de escrita do seu jogo.

source: Defines an inverted stencil.
pt_br: Define um estêncil invertido.

source: Plays the specified Source.
pt_br: Toca a Fonte especificada.

source: stencilFunction
pt_br: funcaoEstencil

source: Gets the write directory name for your game.
pt_br: Obtém o diretório de escrita do seu jogo.

source: The u texture coordinate. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see [[WrapMode]].)
pt_br: A textura de coordenada u. Coordenadas de textura ficam normalmente na faixa de [0, 1], mas podem ser menos ou mais (veja [[WrapMode (Português)|ModoDeAcondicionar]].)

source: It has been renamed from [[love.filesystem.enumerate]]
pt_br: Foi renomeado, antes era [[love.filesystem.enumerate (Português)|love.filesystem.enumerate]]

source: Sets the point size.
pt_br: Configura o tamanho de ponto.

source: Draws text on screen. If no Font is set, one will be created and set (once) if needed.
pt_br: Desenha texto na tela. Se nenhuma Fonte estiver configurada, uma será configurada.

source: * [[Framebuffer]]
pt_br: * [[Framebuffer (Português)|Framebuffer]]

source: Note
pt_br: Nota

source: * [[love.filesystem.append]]
pt_br: * [[love.filesystem.append (Português)|love.filesystem.append]]

source: The expected usage of the SpriteBatch.
pt_br: O modo de uso esperado do LoteDeSprites.

source: This function is always used to reverse a previous [[love.graphics.push|push]] operation.
pt_br: Esta função é sempre usada para reverter uma operação de [[love.graphics.push (Português)|empilhamento]] anterior.

source: style
pt_br: estilo

source: GraphicsLimit
pt_br: LimiteGráfico

source: shader = love.graphics.newShader( code )
pt_br: shader = love.graphics.newShader( codigo )

source: Draw an image (the [https://love2d.org/w/images/c/c3/Resource-HamsterBall.png Hamster Ball]) at 100 by 100 pixels
pt_br: Desenhar uma imagem (a [https://love2d.org/w/images/c/c3/Resource-HamsterBall.png Bola de Hamster]) na posição 100 por 100 pixels.

source: Creates a new [[Source]] from a filepath, [[File]], [[Decoder]] or [[SoundData]].
pt_br: Cria uma nova [[Source (Português)|Fonte]] a partir de um caminho de arquivo, [[File (Português)|Arquivo]], [[Decoder (Português)|Decodificador]] ou [[SoundData (Português)|DadoDeSom]].

source: The drawing color set with [[love.graphics.setColor]] or the per-vertex [[Mesh]] color.
pt_br: A cor de desenho definida com [[love.graphics.setColor (Português)|love.graphics.setColor]] ou a cor por vértice da [[Mesh (Português)|Malha]].

source: Check whether something is a directory.
pt_br: Verifica se algo é um diretório.

source: min, mag = love.graphics.getDefaultImageFilter( )
pt_br: red, amp = love.graphics.getDefaultImageFilter( )

source: * [[love.math.triangulate]]
pt_br: * [[love.math.triangulate (Português)|love.math.triangulate]]

source: The current distance model.
pt_br: O modelo de distância atual.

source: usagehint ("dynamic")
pt_br: dicadeuso ("dynamic")

source: Creates a directory.
pt_br: Cria um diretório.

source: Forward vector of the listener orientation.
pt_br: Vetor dianteiro da orientação do ouvinte.

source: vertexcode
pt_br: codigodevertice

source: wireframe = love.graphics.isWireframe( )
pt_br: estDeArame= love.graphics.isWireframe( )

source: The desired width of the framebuffer.
pt_br: A largura desejada para o framebuffer.

source: Drawing half a circle
pt_br: Desenhando meio círculo

source: Draw a line from the center of the screen to the mouse pointer.
pt_br: Desenhar uma linha do centro da tela para a seta do mouse.

source: A 1 is a a cue to draw a pixel whereas 0 is the opposite and does not draw a pixel, This is done per pixel for the given line.
pt_br: Um 1 é para desenhar um pixel enquanto um 0 é o oposto e não desenha um pixel. Isso é feito para cada pixel em uma dada linha.

source: The mode to open the file in.
pt_br: O modo no qual se deve abrir o arquivo.

source: First event argument.
pt_br: Primeiro argumento do evento.

source: success, errormsg = love.filesystem.append( name, data, size )
pt_br: sucesso, msgerro= love.filesystem.append( nome, dado, tamanho )

source: This function will be removed in a future version. Use [[love.graphics.getSystemLimit]] instead
pt_br: Esta função será removida numa versão futura. Em vez dela, use [[love.graphics.getSystemLimit (Português)|love.graphics.getSystemLimit]]

source: Mount a zip file and then unmount it.
pt_br: Montar um arquivo zip e depois desmontá-lo.

source: The path of the application data directory
pt_br: O caminho do diretório de dados do aplicativo.

source: This function is always used to reverse any previous calls to [[love.graphics.rotate]], [[love.graphics.scale]], [[love.graphics.shear]] or [[love.graphics.translate]].
pt_br: Esta função é sempre usada para reverter quaisquer chamadas anteriores a [[love.graphics.rotate (Português)|love.graphics.rotate]], [[love.graphics.scale (Português)|love.graphics.scale]], [[love.graphics.shear (Português)|love.graphics.shear]] ou [[love.graphics.translate (Português)|love.graphics.translate]].

source: vendor
pt_br: fornecedor

source: Creates a [[File]] object and opens it for reading, writing, or appending.
pt_br: Criar um objeto [[File (Português)|Arquivo]] e o abre para leitura, escrita ou acréscimo.

source: * [[love.graphics.setRenderTarget]]
pt_br: * [[love.graphics.setRenderTarget (Português)|love.graphics.setRenderTarget]]

source: love.graphics.printf("This text is aligned right, and wraps when it gets too big.", 25, 25, 125, "right")
pt_br: love.graphics.printf("Este texto está alinhado à direita, e quebra quando fica grande demais.", 25, 25, 125, "right")
